# Parameter Type Id Rebar Shape Crank Start Angled Length Property

Source: https://www.revitapidocs.com/2026/8c3ad35e-2634-c5cd-6263-453fd6f05c99.htm

---

| Parameter Type Id Rebar Shape Crank Start Angled Length Property |
| --- |

"Start Crank Angled Length"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarShapeCrankStartAngledLength { get; }
```

```
Public Shared ReadOnly Property RebarShapeCrankStartAngledLength As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarShapeCrankStartAngledLength {
	ForgeTypeId^ get ();
}
```

```
static member RebarShapeCrankStartAngledLength : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace